package com.bw.common.utils;

import java.io.UnsupportedEncodingException;
import java.util.Random;

/**
 * ×Ö·û´®¹¤¾ßÀà
 * */
public class StringUtil {
	public static String getValue(String str,int start){
		String str1 = str.substring(start);
		String str2="";
		for(int i=0;i<str1.length();i++) {
			str2+="*";
		}
		
		return str.substring(0,2)+str2;
	}
	//·½·¨1£ºÅĞ¶ÏÔ´×Ö·û´®ÊÇ·ñÓĞÖµ£¬¿ÕÒıºÅ(¿Õ°××Ö·û´®)Ò²ËãÃ»Öµ (5·Ö)
	public static boolean hasLength(String src){
		if(src==null) {
			return false;
		}
	
		if(src.equals("")) {
			return false;
		}
		return true;
	}
		
	
	//·½·¨2£ºÅĞ¶ÏÔ´×Ö·û´®	
	public static boolean hasText(String src){
		
		if(src==null) {
			return false;
		}
		String trim = src.trim();
		if(trim.equals("")) {
			return false;
		}
		return src.length()>0;
	}
	//·½·¨3£º·µ»Ø²ÎÊılength¸öÖĞÎÄºº×Ö×Ö·û´®£¬×Ö·û¼¯±ØĞëÔÚGB2312(Ïàµ±ÓÚÖĞÎÄ¼òÌå)·¶Î§ÄÚ£¬ÀıÈç¡°ÖĞÑ½±»¡±(5·Ö)
	public static String randomChineseString(int length){
		String arr="";
		for(int i=0;i<length;i++) {
			arr+=StringUtil.getChineseChar();
		}
		return arr;
	}
	private static char getChineseChar() {
		 String str = "";
		    int hightPos; //
		    int lowPos;
		    Random random = new Random();
		    hightPos = (176 + Math.abs(random.nextInt(39)));
		    lowPos = (161 + Math.abs(random.nextInt(93)));
		    byte[] b = new byte[2];
		    b[0] = (Integer.valueOf(hightPos)).byteValue();
		    b[1] = (Integer.valueOf(lowPos)).byteValue();
		    try {
		      str = new String(b, "GBK");
		    } catch (UnsupportedEncodingException e) {
		      e.printStackTrace();
		      System.out.println("´íÎó");
		    }
		    return str.charAt(0);
	}
	//·½·¨4£º·µ»ØÖĞÎÄĞÕÃû£¬±ØĞëÒÔÕæÊµĞÕ¿ªÍ·£¬°Ù¼ÒĞÕÔÚ¡°Áù¡¢¸½°Ù¼ÒĞÕ¡±Àï£¬ÃûÊ¹ÓÃ1-2¸öËæ»úºº×Ö(8·Ö)£¬ÄÚ²¿µ÷ÓÃrandomChineseString()·½·¨(3·Ö)¡£·µ»ØÊ¾Àı£º¡°ÁõÑ½±»¡±¡¢¡°Å·Ñô¼°Îª¡±
	public static String generateChineseName(){
		String baiJiaXing[]= {"ÕÔ","Ç®","Ëï","Àî","ÖÜ","Îâ","Ö£","Íõ","·ë","³Â","èú","ÎÀ","½¯","Éò","º«","Ñî","Öì","ÇØ","ÓÈ","Ğí","ºÎ","ÂÀ","Ê©","ÕÅ","¿×","²Ü","ÑÏ","»ª","½ğ","Îº","ÌÕ","½ª","Æİ","Ğ»","×Ş","Ó÷","°Ø","Ë®","ñ¼","ÕÂ","ÔÆ","ËÕ","ÅË","¸ğ","ŞÉ","·¶","Åí","ÀÉ","Â³","Î¤","²ı","Âí","Ãç","·ï","»¨","·½","Óá","ÈÎ","Ô¬","Áø","Ûº","±«","Ê·","ÌÆ","·Ñ","Á®","á¯","Ñ¦","À×","ºØ","Äß","ÌÀ","ëø","Òó","ÂŞ","±Ï","ºÂ","Úù","°²","³£","ÀÖ","ÓÚ","Ê±","¸µ","Æ¤","±å","Æë","¿µ","Îé","Óà","Ôª","²·","¹Ë","ÃÏ","Æ½","»Æ","ºÍ","ÄÂ","Ïô","Òü","Ò¦","ÉÛ","Õ¿","Íô","Æî","Ã«","Óí","µÒ","Ã×","±´","Ã÷","ê°","¼Æ","·ü","³É","´÷","Ì¸","ËÎ","Ã©","ÅÓ","ĞÜ","¼Í","Êæ","Çü","Ïî","×£","¶­","Áº","¶Å","Èî","À¶","Ãö","Ï¯","¼¾","Âé","Ç¿","¼Ö","Â·","Â¦","Î£","½­","Í¯","ÑÕ","¹ù","Ã·","Ê¢","ÁÖ","µó","ïñ","Ğì","Çğ","Âæ","¸ß","ÏÄ","²Ì","Ìï","·®","ºú","Áè","»ô","Óİ","Íò","Ö§","¿Â","êÃ","¹Ü","Â¬","Äª","¾­","·¿","ôÃ","çÑ","¸É","½â","Ó¦","×Ú","¶¡","Ğû","êÚ","µË","Óô","µ¥","º¼","ºé","°ü","Öî","×ó","Ê¯","´Ş","¼ª","Å¥","¹¨","³Ì","ïú","ĞÏ","»¬","Åá","Â½","ÈÙ","ÎÌ","Ü÷","Ñò","ì¶","»İ","Õç","üL","¼Ò","·â","ÜÇ","ôà","´¢","½ù","¼³","Úû","ÃÓ","ËÉ","¾®","¶Î","¸»","Î×","ÎÚ","½¹","°Í","¹­","ÄÁ","Úó","É½","¹È","³µ","ºî","åµ","Åî","È«","Û­","°à","Ñö","Çï","ÖÙ","ÒÁ","¹¬","Äş","³ğ","èï","±©","¸Ê","Ğ±","À÷","ÈÖ","×æ","Îä","·û","Áõ","¾°","Õ²","Êø","Áú","Ò¶","ĞÒ","Ë¾","ÉØ","Û¬","Àè","¼»","±¡","Ó¡","ËŞ","°×","»³","ÆÑ","Û¢","´Ó","¶õ","Ë÷","ÏÌ","¼®","Àµ","×¿","İş","ÍÀ","ÃÉ","³Ø","ÇÇ","Òõ","Óô","ñã","ÄÜ","²Ô","Ë«","ÎÅ","İ·","µ³","µÔ","Ì·","¹±","ÀÍ","åÌ","¼§","Éê","·ö","¶Â","È½","Ô×","Ûª","Óº","àS","è³","É£","¹ğ","å§","Å£","ÊÙ","Í¨","±ß","ìè","Ñà","¼½","Û£","ÆÖ","ÉĞ","Å©","ÎÂ","±ğ","×¯","êÌ","²ñ","öÄ","ÑÖ","³ä","Ä½","Á¬","Èã","Ï°","»Â","°¬","Óã","Èİ","Ïò","¹Å","Ò×","É÷","¸ê","ÁÎ","â×","ÖÕ","ôß","¾Ó","ºâ","²½","¶¼","¹¢","Âú","ºë","¿ï","¹ú","ÎÄ","¿Ü","¹ã","Â»","ãÚ","¶«","Å·","ì¯","ÎÖ","Àû","Îµ","Ô½","Ùç","Â¡","Ê¦","¹®","ØÇ","Äô","êË","¹´","°½","ÈÚ","Àä","ö¤","ĞÁ","ãÛ","ÄÇ","¼ò","ÈÄ","¿Õ","Ôø","Îã","É³","Ø¿","Ñø","¾Ï","Ğë","·á","³²","¹Ø","Øá","Ïà","²é","ºó","¾£","ºì","ÓÎ","óÃ","È¨","åÏ","¸Ç","Òæ","»¸","¹«","½ú","³ş","ÑÖ","·¨","Èê","Û³","Í¿","ÇÕ","ÔÀ","Ë§","çÃ","¿º","¿ö","ºó","ÓĞ","ÇÙ","ÉÌ","Ä²","ÙÜ","Ù¦","²®","ÉÍ","Ä«","¹ş","ÚÛ","óÎ","Äê","°®","Ñô","Ù¡","ÍòÙ¹","Ë¾Âí","ÉÏ¹Ù","Å·Ñô","ÏÄºî","Öî¸ğ","ÎÅÈË","¶«·½","ºÕÁ¬","»Ê¸¦","Î¾³Ù","¹«Ñò","å£Ì¨","¹«Ò±","×ÚÕş","å§Ñô","´¾ÓÚ","µ¥ÓÚ","Ì«Êå","ÉêÍÀ","¹«Ëï","ÖÙËï","ĞùÔ¯","Áîºü","ïñÀë","ÓîÎÄ","³¤Ëï","Ä½Èİ","ÏÊÓÚ","ãÌÇğ","Ë¾Í½","Ë¾¿Õ","Ø¢¹Ù","Ë¾¿Ü","Øë","¶½","×Ó³µ","ò§Ëï","¶ËÄ¾","Î×Âí","¹«Î÷","Æáµñ","ÀÖÕı","ÈÀæá","¹«Á¼","ÍØ°Î","¼Ğ¹È","Ô×¸¸","¹ÈÁº","¶Î¸É","°ÙÀï","¶«¹ù","ÄÏÃÅ","ºôÑÓ","¹é","º£","ÑòÉà","Î¢Éú","ÁºÇğ","×óÇğ","¶«ÃÅ","Î÷ÃÅ","ÄÏ¹¬"};
		int random = RandomUtil.random(0,baiJiaXing.length-1);
		
		return baiJiaXing[random]+StringUtil.randomChineseString(2);

	}
	public static boolean isPhone(String str) {
		String reg="^1[34578]\\d{9}$";
		return str.matches(reg);
	}
	public static boolean isEmail(String str) {
		String reg="^\\w+@\\w+(\\.com|\\.cn)+$";
		return str.matches(reg);
	}
	public static boolean isNumber(String str) {
		String reg="^(-|\\+)?\\d+(\\.\\d+)?$";
		str = str.trim();
		return str.matches(reg);
	}
}
